# basics
brew 'coreutils'
brew 'git'
brew 'stow'
brew 'zsh'
brew 'llvm'

# nvim
cask 'neovim-nightly'
tap 'marc1/neovim-nightly'

# wm + hk
tap 'koekeishiya/formulae'
brew 'yabai'
brew 'skhd'

# misc
brew 'lf'
brew 'rustup'
brew 'rust-analyzer'
brew 'rg'
brew 'fzf'
brew 'fd'

# fonts
tap 'marc1/apple-fonts'
cask 'font-sf-mono'

tap 'homebrew/cask'
cask 'basictex'
cask 'iterm2'
cask 'bitwarden'
cask 'discord'
cask 'zoom'
